const quote = [//array of objects
  {
    text: " {لَا نُرِيدُ مِنكُمْ جَزَاءً وَلَا شُكُورًا}",
    author: "سورة الإنسان، آية: ٩",
  },
  {
    text: "{ربنا واجعلنا ‌مسلمَين ‌لك ومن ذريتنا أمة مسلمة لك}",
    author: "سورة البقرة، آية: ١٢٨",
  },
  {
    text: "{وإذا سألتموهن متاعًا فاسألوهن من وراء حجاب ذلكم أطهر لقلوبكم وقلوبهن}",
    author: "سورة الأحزاب، آية: ٥٣",
  },
  {
    text: "{إنَّ الَّذِينَ قَالوا رَبّنَا اللَّهُ ثُمَّ اسْتَقَامُوا}",
    author: "سورة فصلت، آية: ٣٠"
},
  {
    text: "{إن تُبدُوا شيئًا أو تخفوه فإن الله كان بكل شيء عليمًا}",
    author: "سورة الأحزاب آية: ٥٤",
  },
  {
    text: "{لا أَبْرَحُ حَتَّىٰ أَبْلُغَ }",
    author: " سوره الكهف ايه: 60",
  },
  {
    text: "{وَمَا كَانَ رَبُّكَ نَسِيًّا}",
    author: "سوره مريم ايه :64",
  },
  {
    text: "{وَإِذَا سَأَلَكَ عِبَادِي عَنِّي فَإِنِّي قَرِيبٌ ۖ أُجِيبُ دَعْوَةَ الدَّاعِ إِذَا دَعَانِ}",
    author: "سوره البقره ايه 186",
  },
  {
    text: "{وَلَا تُطِعْ مَنْ أَغْفَلْنَا قَلْبَهُ عَن ذِكْرِنَا وَاتَّبَعَ هَوَاهُ وَكَانَ أَمْرُهُ فُرُطًا}",
    author: "سوره الكهف ايه:28",
  },
  {
    text:"{إِنَّكَ لَا تَهْدِي مَنْ أَحْبَبْتَ وَلَٰكِنَّ اللَّهَ يَهْدِي مَن يَشَاءُ}",
    author: "سوره القصص ايه:56",
  },
  {
    text: "{الَّذِينَ إِذَا أَصَابَتْهُمْ مُصِيبَةٌ قَالُوا إِنَّا لِلَّهِ وَإِنَّا إِلَيْهِ رَاجِعُونَ}",
    author: "سوره البقره ايه:156",
  },
  {
    text: "{ فَقُلْتُ اسْتَغْفِرُوا رَبَّكُمْ إِنَّهُ كَانَ غَفَّارًا}",
    author: "سوره نوح ايه:10",
  },

  {
    text: "{وَإِذَا قُرِئَ الْقُرْآنُ فَاسْتَمِعُوا لَهُ وَأَنْصِتُوا لَعَلَّكُمْ تُرْحَمُونَ}",
    author: "سوره الاعراف ايه:204",
  },
  {
    text: "{لَا يُكَلِّفُ اللَّهُ نَفْسًا إِلَّا وُسْعَهَا }",
    author: "سوره البقره ايه:286",
  },
  
];

let previousIndex = "";

function newQuote() {
  let index = "";
  do {
    index = Math.floor(Math.random() * quote.length);
  } while (previousIndex == index);
  previousIndex = index;
  console.log(index);
  document.getElementById("quote").innerHTML = quote[index].text;
  document.getElementById("author").innerHTML = quote[index].author;
}